app/views/names/index.html.erb

SELECT "states".* FROM "states"  WHERE "states"."name_id" IN (20, 16, 24, 21, 15, 22, 17, 2, 7, 4, 5, 6, 3, 8, 9, 10, 13, 14, 12, 19, 1, 11, 18, 23, 26, 27, 28, 29, 25, 30)
---
        <td><%= link_to 'Destroy', name, method: :delete, data: { confirm: 'Are you sure?' } %></td>
        <% name.states.each do |state| %>