app/views/names/show.html.erb

            <% newAtom = 0 %>
            <% @name.states.order('id ASC').each_with_index do |state, i| %>
---
SELECT "states".* FROM "states"  WHERE "states"."name_id" = $1  ORDER BY id ASC  [["name_id", 2]]