app/controllers/names_controller.rb

  def index
    @names = Name.includes(:states).order("id ASC").all
---
SELECT "names".* FROM "names"   ORDER BY id ASC
SELECT "states".* FROM "states"  WHERE "states"."name_id" IN (20, 16, 24, 21, 15, 22, 17, 2, 7, 4, 5, 6, 3, 8, 9, 10, 13, 14, 12, 19, 1, 11, 18, 23, 26, 27, 28, 29, 25, 30)

  def create
    @name = Name.new(name_params)

    respond_to do |format|
      if @name.save
---
INSERT INTO "names" ("calc_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["calc_name", "Nitrosobenzene perp"], ["created_at", "2014-08-19 19:02:32.442551"], ["updated_at", "2014-08-19 19:02:32.442551"]]

  def update
    respond_to do |format|
      if @name.update(name_params)
---
UPDATE "names" SET "atom_list" = $1, "cluster_list" = $2, "updated_at" = $3 WHERE "names"."id" = 32  [["atom_list", "{}"], ["cluster_list", "{\"3\",\"3\",\"1\",\"1\",\"11\"}"], ["updated_at", "2014-08-19 19:16:23.711657"]]

    def set_name
      @name = Name.find(params[:id])
---
SELECT  "names".* FROM "names"  WHERE "names"."id" = $1  ORDER BY id ASC LIMIT 1  [["id", 2]]